app/controllers/accounts_controller.rb

    def create
        userID = params[:user_id]
        @account = Account.new(account_params)
        @account.user_id = userID
        @account.account_no = rand(1..999999)
        if @account.save
---
INSERT INTO "accounts" ("account_no", "balance", "created_at", "updated_at", "account_name", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["account_no", 775170], ["balance", 300000.0], ["created_at", "2021-11-11 11:49:04.089600"], ["updated_at", "2021-11-11 11:49:04.089600"], ["account_name", "Savings ISA"], ["user_id", 1]]

    def destroy
        puts "*" *100
        @account = Account.find(params[:id])
        if @account.destroy
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "accounts" WHERE "accounts"."id" = ?  [["id", 1]]

    def find_user
        @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]