app/controllers/transactions_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ? AND "accounts"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def create
        @transaction = Transaction.new(transaction_params)
        @account = @user.accounts.find(@transaction.sender_id)

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Receiver"], ["LIMIT", 1]]
---
    def find_receiver
        receiver = User.find_by(username: @transaction.receiver_name)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_user
        @user = User.find(params[:user_id])